In [ ]:
import pandas as pd
import os
from google.colab import drive

In [ ]:
pd.set_option('display.max_columns', None)
# display.[max_categories, max_columns, max_colwidth, max_dir_items,
#   max_info_columns, max_info_rows, max_rows, max_seq_items, memory_usage,
#   min_rows, multi_sparse, notebook_repr_html, pprint_nest_depth, precision,
#   show_dimensions]

In [ ]:
path = './drive/MyDrive/Colab Notebooks/'

In [ ]:
# 나의 구글 드라이브 연결
drive.mount("/content/drive")

Mounted at /content/drive

# 데이터 불러오기

In [ ]:
# 둘레길 관심인구 정보
df1 = pd.read_csv(path + "FPL010101.csv")
# 둘레길 주변관광 이용자 정보
df2 = pd.read_csv(path + "FPL010401.csv")
# 둘레길 선호 관광 장소
df3 = pd.read_csv(path + "FPL010501.csv")
# 둘레길 관심인구 관심사/관심분야 (포털 검색 분야) 정보
df4 = pd.read_csv(path + "FPL010801.csv")
# 둘레길 관심인구 라이프스타일 (온라인쇼핑몰 이용 카테고리 정보)
df5 = pd.read_csv(path + "FPL010901.csv")

# 둘레길[circumference trekking way]
> 거주 지역, 명소 따위의 주변에 난 길을 말한다.산책을 위한 길이 일반적이다.

### df1 : 둘레길 관심인구 정보 (Total : 44,373)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 부산 | 인천 | 대구
|둘레길 | 서울 둘레길 | 영남 알프스 | 지리산 둘레길 | 북한산 둘레길 | 횡성호수길 |
|거주지 20 | 서울 | 경기 | 부산 | 인천 | 대구
|둘레길 | 서울 둘레길 | 영남 알프스 | 지리산 둘레길 | 북한산 둘레길 | 대부해솔길 |
|거주지 30 | 서울 | 경기 | 부산 | 인천 | 대구
|둘레길 | 서울 둘레길 | 영남 알프스 | 지리산 둘레길 | 북한산 둘레길 | 횡성호수길 |
|거주지 4560 | 서울 | 경기 | 인천 | 부산 | 대구
|둘레길 | 서울 둘레길 | 영남 알프스 | 지리산 둘레길 | 북한산 둘레길 | 영덕 블루로드 |

`[2-30] 여 : 9,092(50.3%), 남 : 8,824(49.7%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|17,936(40.4%)|5,143(28.7%)|7,390(41.2%)|
|20|5,417(12.2%)|554(3.1%)|1,172(6.5%)|
|30|12,499(28.2%)|4,589(25.6%)|6,218(34.7%)|

---

### df2 : 둘레길 주변관광 이용자 정보 (Total : 9,468)
### df3 : 둘레길 선호 관광 장소

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230| 서울 | 경기 | 부산 | 인천 | 대구 |
|주변관광 230 | 울릉도 | 해운대 | 남원 | 안면도 | 죽도 |
|주변관광 20 | 울릉도 | 해운대 | 죽도 | 남원 | 한탄강 |
|주변관광 30 | 해운대 | 울릉도 | 남원 | 안면도 | 태종대 |
||||||
|거주지 450 | 서울 | 경기 | 인천 | 부산 | 대구 |
|주변관광 450 | 해운대 | 울릉도 | 남원 | 안면도 | 한탄강 |

`[2-30] 여 : 2,381(58.3%), 남 : 1,705(41.7%)`


|Age|이용인구|Car|job|
|--|--|--|--|
|2-30|4,086(43.2%)|1,275(31.2%)|943(23.1%)|
|20|1,204(12.7%)|130(3.2%)|397(9.7%)|
|30|2,882(30.4%)|1,145(28.0%)|546(13.4%)|

---

### df4 : 둘레길 관심인구 관심사/관심분야 (포털 검색 분야) 정보 (Total : 156,516)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 23| 서울 | 경기 | 인천 | 경남 | 대구 |
|주요 관심 23(서울) | TV연예 | 사회 | 스포츠 | 경제 | 정치 |
|거주지 2| 경기 | 서울 | 부산 | 인천 | 경북 |
|주요 관심 2(경기) | 사회 | 정치 | TV연예 | 스포츠 | 정치 |
|거주지 3| 서울 | 경기 | 인천 | 경남 | 대구 |
|주요 관심 3(서울) | TV연예 | 사회 | 스포츠 | 경제 | 정치 |

`[2-30] 여 : 38,858(59.8%), 남 : 26,154(40.2%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|65,012(41.5%)|25,614(39.4%)|33,350(51.3%)|
|20|14,883(9.5%)|3,167(4.9%)|4,039(6.2%)|
|30|50,129(32.0%)|22,447(34.5%)|27,469(42.3%)|

---

### df5 : 둘레길 관심인구 라이프스타일 (온라인쇼핑몰 이용 카테고리 정보) (Total : 68,606)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 23| 서울 | 경기 | 부산 | 대구 | 인천 |
|카데고리 23 (서울) | 식품/건강 | 패션의류 | 생활/주방 | 뷰티 | 패션잡화 |
|거주지 2| 부산 | 서울 | 경기 | 인천 | 대구 |
|카데고리 2 (부산) | 패션의류 | 패션잡화 | 식품/건강 | 뷰티 | 디지털/가전 |
|거주지 3| 서울 | 경기 | 대구 | 인천 | 부산 |
|카데고리 3 (서울) | 식품/건강 | 패션의류 | 생활/주방 | 뷰티 | 패션잡화 |



`[2-30] 여 : 21,268(65.9%), 남 : 1102(34.1%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|32,292(47.1%)|10,957(33.9%)|16,129(49.9%)|
|20|8,887(13.0%)|647(2.0%)|3,851(11.9%)|
|30|23,405(34.1%)|10,310(31.9%)|12,278(38.0%)|

1. 부모랑 같이 살아서  
2. 부모랑 같이 가서  
3. 자동차 외에는 교통수단 제외(오토바이)
4. 해외가 부담이여서

# [서울 둘레길](https://gil.seoul.go.kr/walk/sub/introduce.jsp#none)
> 서울을 한 바퀴 휘감는 총 연장 156.5km의 서울둘레길은 8개 코스

# [영남 알프스](https://ynalps.co.kr)
> 울주군 상북면 · 삼남면 · 언양읍 · 두서면 산언 저리에 조성된 둘레길

# [지리산 둘레길](http://jirisantrail.kr)
> 지리산 둘레를 잇는 길에서 만나는, 자연과 마을, 역사와 문화의 의미를 다시 찾아내 잇고 보듬는 길입니다.

# [북한산 둘레길](https://www.knps.or.kr/portal/dulegil/bukhansan/index.do)
> 기존의 샛길을 연결하고 다듬어서 북한산 자락을 완만하게 걸을 수 있도록 조성한 저지대 수평 산책로입니다.

# [횡성호수길](https://www.hsg.go.kr/tour/contents.do?key=1361)
> 그림같은 산세와 잔잔한 호수가 어우러져 한폭의 수묵화 같은 풍경을 자아내는 곳이다

# [대부해솔길](https://www.ansan.go.kr/tourinfo/common/cntnts/selectContents.do?cntnts_id=C0001983)
> 해안선을 따라 대부도를 한 바퀴 둘러볼 수 있는 산책길로 91km에 이르는 총 10개 코스를 통해 안산 대부도의 감탄스러운 자연 경관을 빠짐없이 즐기며 걸을 수 있습니다.

# [영덕 블루로드](http://blueroad.yd.go.kr/ko/open_content/main_page/)
> 부산에서 강원도 고성에 이르는 688km의 해파랑길에 일부로, 영덕 대게공원을 출발하여 축산항을 거쳐 고래불해수욕장에 이르는 도보여행을 위해 조성된 약 64.6km의 해안길이다.

---
---
# df1 : 둘레길 관심인구

In [ ]:
# Total : 44,373
# df1[(df1['연령'] == 2) | (df1['연령'] ==  3)]
df1_23 = df1[df1['연령'].isin([2, 3])]     # 17,916, 40.4%
df1_2 = df1[(df1['연령'] == 2)]            #  5,417, 12.2%
df1_3 = df1[(df1['연령'] == 3)]            # 12,499, 28.2%
df1_456 = df1[df1['연령'].isin([4, 5, 6])] # 26,457, 59.6%

In [ ]:
df1_23.head()

,길,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
6,영남알프스,영남알프스 간월재 쉽게 가는법 사진찍기좋은곳 : 네이버 블로그,M,2,NaN,NaN,,,NaN,서울,송파구,문정동,NaN
7,영남알프스,울산 억새 간월재 영남알프스 옷차림 가는방법 후기까지 : 네이버 블로그,F,2,NaN,NaN,,,NaN,서울,동대문구,전농2동,NaN
9,금오도비렁길,여수 금오도 여행. 금오도 비렁길 3코스.1박2일. 펜션숙박 : 네이버 블로그,F,3,NaN,NaN,,,NaN,경기,의정부시,낙양동,NaN
14,다산길,파주시 연다산길 62 - Daum 검색,F,2,"사무직 (일반사무직, 공무원, 직업군인)",100~199만원,아니오,,기타,충남,논산시,내동,"경차 (모닝, 스파크 등)"
15,둘레길,태안 학암포 둘레길 - Daum 검색,F,3,NaN,NaN,,,NaN,인천,중구,운서동,NaN

In [ ]:
road_1 = df1_23.query("길 == '서울둘레길'")
road_2 = df1_23.query("길 == '영남알프스'")
road_3 = df1_23.query("길 == '지리산둘레길'")
road_4 = df1_23.query("길 == '북한산둘레길'")
road_5 = df1_23.query("길 == '횡성호수길'")

In [ ]:
road2_1 = df1_2.query("길 == '서울둘레길'")
road2_2 = df1_2.query("길 == '영남알프스'")
road2_3 = df1_2.query("길 == '지리산둘레길'")
road2_4 = df1_2.query("길 == '북한산둘레길'")
road2_5 = df1_2.query("길 == '대부해솔길'")

In [ ]:
road3_1 = df1_3.query("길 == '서울둘레길'")
road3_2 = df1_3.query("길 == '영남알프스'")
road3_3 = df1_3.query("길 == '지리산둘레길'")
road3_4 = df1_3.query("길 == '북한산둘레길'")
road3_5 = df1_3.query("길 == '횡성호수길'")

### 서울둘레길

In [ ]:
road_1.query("성별 == 'F'")['시도'].value_counts()[:3],\
road2_1.query("성별 == 'F'")['시도'].value_counts()[:3],\
road3_1.query("성별 == 'F'")['시도'].value_counts()[:3]

(서울    276
 경기    183
 부산     52
 Name: 시도, dtype: int64,
 서울    91
 경기    44
 부산    17
 Name: 시도, dtype: int64,
 서울    185
 경기    139
 인천     38
 Name: 시도, dtype: int64)

In [ ]:
len(road_1.query("성별 == 'F'")),\
len(road_1.query("성별 == 'F' and 시도 == '서울'")),\
len(road_1.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()")),\
len(road2_1.query("성별 == 'F'")),\
len(road2_1.query("성별 == 'F' and 시도 == '서울'")),\
len(road2_1.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()")),\
len(road3_1.query("성별 == 'F'")),\
len(road3_1.query("성별 == 'F' and 시도 == '서울'")),\
len(road3_1.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()"))

(754, 276, 45, 229, 91, 3, 525, 185, 42)

In [ ]:
road_1.query("성별 == 'M'")['시도'].value_counts()[:3],\
road2_1.query("성별 == 'M'")['시도'].value_counts()[:3],\
road3_1.query("성별 == 'M'")['시도'].value_counts()[:3]

(서울    243
 경기    182
 부산     58
 Name: 시도, dtype: int64,
 서울    64
 경기    59
 부산    25
 Name: 시도, dtype: int64,
 서울    179
 경기    123
 부산     33
 Name: 시도, dtype: int64)

In [ ]:
len(road_1.query("성별 == 'M'")),\
len(road_1.query("성별 == 'M' and 시도 == '서울'")),\
len(road_1.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(road2_1.query("성별 == 'M'")),\
len(road2_1.query("성별 == 'M' and 시도 == '서울'")),\
len(road2_1.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(road3_1.query("성별 == 'M'")),\
len(road3_1.query("성별 == 'M' and 시도 == '서울'")),\
len(road3_1.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(787, 243, 70, 257, 64, 6, 530, 179, 64)

### 영남알프스

In [ ]:
road_2.query("성별 == 'F'")['시도'].value_counts()[:3],\
road2_2.query("성별 == 'F'")['시도'].value_counts()[:3],\
road3_2.query("성별 == 'F'")['시도'].value_counts()[:3]

(서울    184
 경기    162
 부산     45
 Name: 시도, dtype: int64,
 서울    59
 경기    49
 부산    19
 Name: 시도, dtype: int64,
 서울    125
 경기    113
 인천     30
 Name: 시도, dtype: int64)

In [ ]:
len(road_2.query("성별 == 'F'")),\
len(road_2.query("성별 == 'F' and 시도 == '서울'")),\
len(road_2.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()")),\
len(road2_2.query("성별 == 'F'")),\
len(road2_2.query("성별 == 'F' and 시도 == '서울'")),\
len(road2_2.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()")),\
len(road3_2.query("성별 == 'F'")),\
len(road3_2.query("성별 == 'F' and 시도 == '서울'")),\
len(road3_2.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()"))

(568, 184, 39, 181, 59, 4, 387, 125, 35)

In [ ]:
road_2.query("성별 == 'M'")['시도'].value_counts()[:3],\
road2_2.query("성별 == 'M'")['시도'].value_counts()[:3],\
road3_2.query("성별 == 'M'")['시도'].value_counts()[:3]

(서울    194
 경기    143
 인천     42
 Name: 시도, dtype: int64,
 서울    57
 경기    35
 인천    13
 Name: 시도, dtype: int64,
 서울    137
 경기    108
 인천     29
 Name: 시도, dtype: int64)

In [ ]:
len(road_2.query("성별 == 'M'")),\
len(road_2.query("성별 == 'M' and 시도 == '서울'")),\
len(road_2.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(road2_2.query("성별 == 'M'")),\
len(road2_2.query("성별 == 'M' and 시도 == '서울'")),\
len(road2_2.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(road3_2.query("성별 == 'M'")),\
len(road3_2.query("성별 == 'M' and 시도 == '서울'")),\
len(road3_2.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(595, 194, 53, 178, 57, 5, 417, 137, 48)

### 지리산둘레길

In [ ]:
road_3.query("성별 == 'F'")['시도'].value_counts()[:3],\
road2_3.query("성별 == 'F'")['시도'].value_counts()[:3],\
road3_3.query("성별 == 'F'")['시도'].value_counts()[:3]

(서울    159
 경기    149
 인천     29
 Name: 시도, dtype: int64,
 서울    52
 경기    29
 충남     7
 Name: 시도, dtype: int64,
 경기    120
 서울    107
 인천     23
 Name: 시도, dtype: int64)

In [ ]:
len(road_3.query("성별 == 'F'")),\
len(road_3.query("성별 == 'F' and 시도 == '서울'")),\
len(road_3.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()")),\
len(road2_3.query("성별 == 'F'")),\
len(road2_3.query("성별 == 'F' and 시도 == '서울'")),\
len(road2_3.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()")),\
len(road3_3.query("성별 == 'F'")),\
len(road3_3.query("성별 == 'F' and 시도 == '경기'")),\
len(road3_3.query("성별 == 'F' and 시도 == '경기' and 자동차.notnull()"))

(476, 159, 35, 130, 52, 3, 346, 120, 72)

In [ ]:
road_3.query("성별 == 'M'")['시도'].value_counts()[:3],\
road2_3.query("성별 == 'M'")['시도'].value_counts()[:3],\
road3_3.query("성별 == 'M'")['시도'].value_counts()[:3]

(서울    163
 경기    104
 부산     36
 Name: 시도, dtype: int64,
 서울    51
 경기    33
 인천    10
 Name: 시도, dtype: int64,
 서울    112
 경기     71
 부산     27
 Name: 시도, dtype: int64)

In [ ]:
len(road_3.query("성별 == 'M'")),\
len(road_3.query("성별 == 'M' and 시도 == '서울'")),\
len(road_3.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(road2_3.query("성별 == 'M'")),\
len(road2_3.query("성별 == 'M' and 시도 == '서울'")),\
len(road2_3.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(road3_3.query("성별 == 'M'")),\
len(road3_3.query("성별 == 'M' and 시도 == '서울'")),\
len(road3_3.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(472, 163, 42, 164, 51, 5, 308, 112, 37)

### 북한산둘레길

In [ ]:
road_4.query("성별 == 'F'")['시도'].value_counts()[:3],\
road2_4.query("성별 == 'F'")['시도'].value_counts()[:3],\
road3_4.query("성별 == 'F'")['시도'].value_counts()[:3]

(서울    125
 경기     86
 부산     26
 Name: 시도, dtype: int64,
 서울    39
 경기    18
 부산     8
 Name: 시도, dtype: int64,
 서울    86
 경기    68
 부산    18
 Name: 시도, dtype: int64)

In [ ]:
len(road_4.query("성별 == 'F'")),\
len(road_4.query("성별 == 'F' and 시도 == '서울'")),\
len(road_4.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()")),\
len(road2_4.query("성별 == 'F'")),\
len(road2_4.query("성별 == 'F' and 시도 == '서울'")),\
len(road2_4.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()")),\
len(road3_4.query("성별 == 'F'")),\
len(road3_4.query("성별 == 'F' and 시도 == '서울'")),\
len(road3_4.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()"))

(363, 125, 25, 96, 39, 3, 267, 86, 22)

In [ ]:
road_4.query("성별 == 'M'")['시도'].value_counts()[:3],\
road2_4.query("성별 == 'M'")['시도'].value_counts()[:3],\
road3_4.query("성별 == 'M'")['시도'].value_counts()[:3]

(서울    116
 경기     82
 부산     20
 Name: 시도, dtype: int64,
 서울    32
 경기    24
 부산     7
 Name: 시도, dtype: int64,
 서울    84
 경기    58
 대구    13
 Name: 시도, dtype: int64)

In [ ]:
len(road_4.query("성별 == 'M'")),\
len(road_4.query("성별 == 'M' and 시도 == '서울'")),\
len(road_4.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(road2_4.query("성별 == 'M'")),\
len(road2_4.query("성별 == 'M' and 시도 == '서울'")),\
len(road2_4.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(road3_4.query("성별 == 'M'")),\
len(road3_4.query("성별 == 'M' and 시도 == '서울'")),\
len(road3_4.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(343, 116, 36, 111, 32, 4, 232, 84, 32)

### 횡성호수길

In [ ]:
road_5.query("성별 == 'F'")['시도'].value_counts()[:3],\
road3_5.query("성별 == 'F'")['시도'].value_counts()[:3]

(서울    84
 경기    42
 인천    19
 Name: 시도, dtype: int64,
 서울    61
 경기    27
 인천    15
 Name: 시도, dtype: int64)

In [ ]:
len(road_5.query("성별 == 'F'")),\
len(road_5.query("성별 == 'F' and 시도 == '서울'")),\
len(road_5.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()")),\
len(road3_5.query("성별 == 'F'")),\
len(road3_5.query("성별 == 'F' and 시도 == '서울'")),\
len(road3_5.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()"))

(224, 84, 16, 152, 61, 14)

In [ ]:
road_5.query("성별 == 'M'")['시도'].value_counts()[:3],\
road3_5.query("성별 == 'M'")['시도'].value_counts()[:3]

(서울    82
 경기    40
 경남    16
 Name: 시도, dtype: int64,
 서울    58
 경기    29
 경남    14
 Name: 시도, dtype: int64)

In [ ]:
len(road_5.query("성별 == 'M'")),\
len(road_5.query("성별 == 'M' and 시도 == '서울'")),\
len(road_5.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(road3_5.query("성별 == 'M'")),\
len(road3_5.query("성별 == 'M' and 시도 == '서울'")),\
len(road3_5.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(199, 82, 27, 140, 58, 25)

### 대부해솔길

In [ ]:
road2_5.query("성별 == 'F'")['시도'].value_counts()[:3]

서울    30
경기    19
부산     6
Name: 시도, dtype: int64

In [ ]:
len(road2_5.query("성별 == 'F'")),\
len(road2_5.query("성별 == 'F' and 시도 == '서울'")),\
len(road2_5.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()"))

(74, 30, 2)

In [ ]:
road2_5.query("성별 == 'M'")['시도'].value_counts()[:3]

서울    20
인천     6
경기     5
Name: 시도, dtype: int64

In [ ]:
len(road2_5.query("성별 == 'M'")),\
len(road2_5.query("성별 == 'M' and 시도 == '서울'")),\
len(road2_5.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(55, 20, 3)

### 직업 기입한 인원 중에서 학생 퇴직 주부 무직 제외

In [ ]:
df1_23[~df1_23['직업'].isnull() &\
       ~df1_23['직업'].astype(str).str.contains('학생|퇴직|주부') &\
       ~(df1_23['직업'].astype(str) == '무직')]

,길,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
14,다산길,파주시 연다산길 62 - Daum 검색,F,2,"사무직 (일반사무직, 공무원, 직업군인)",100~199만원,아니오,,기타,충남,논산시,내동,"경차 (모닝, 스파크 등)"
23,서울한양도성길,서울 한양도성길 따라 남산타워 오르기 : 네이버 블로그,F,3,"사무직 (일반사무직, 공무원, 직업군인)",500~599만원,아니오,,아파트/ 주상복합,서울,금천구,시흥2동,NaN
24,강화나들길,폭염속 강화 나들길 걷기 조양방직 : 네이버 블로그,M,3,"판매직 (상점점원, 보험설계사, 노점상)",200~299만원,아니오,,연립주택/ 다세대/ 빌라,서울,관악구,낙성대동,NaN
42,둘레길,[단독]둘레길 개... :: 네이버 뉴스,F,3,"생산/노무직 (생산감독, 경비원, 공장근로자)","1,000만원 이상",아니오,,오피스텔,충남,천안시 서북구,두정동,NaN
60,횡성호수길,여행스케치 [YJ113] 횡성 호수길 + 청태산휴양림 + 월정사 + 상품권 제공 (당일),F,3,"사무직 (일반사무직, 공무원, 직업군인)",200~299만원,예,자녀 없음,아파트/ 주상복합,부산,수영구,남천동,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
44363,남해바래길,남해바래길펜션타운,M,2,"전문직 (의사, 판검사, 예술가, 종교인)",900~999만원,아니오,,아파트/ 주상복합,부산,영도구,남항동2가,NaN
44364,물소리길,물소리길 : 네이버 통합검색,F,3,"사무직 (일반사무직, 공무원, 직업군인)",600~699만원,예,자녀 없음,아파트/ 주상복합,경기,부천시 소사구,소사본동,"소형차 (액센트, 프라이드, 아베오, 피아트급 등)"
44365,둘레길,바다를 끼고 걸어보는 최고의 해안둘레길 선바우길 :: 가족여행 주말여행 경북여행 바...,M,3,기타,600~699만원,예,자녀 있음,아파트/ 주상복합,경북,경산시,중산동,"준중형SUV (투싼, 스포티지, QM5, 티구안급 등)"
44367,고인돌질마재따라100리길,고창 가볼만한곳 고인돌 질마재따라 100리길{{ 연기제 소요사 미당시문학관 인촌 김...,F,3,"사무직 (일반사무직, 공무원, 직업군인)",600~699만원,예,자녀 있음,아파트/ 주상복합,경기,수원시 영통구,망포동,"경차 (모닝, 스파크 등)"
44368,둘레길,제주 둘레길 : 네이버 통합검색,M,3,"사무직 (일반사무직, 공무원, 직업군인)",300~399만원,아니오,,아파트/ 주상복합,광주,북구,문흥2동,NaN

### 가려는 둘레길과 검색어 비교

In [ ]:
len(road_1), road_1['사이트제목'].str.contains("서울").sum(),\
len(road_2), road_2['사이트제목'].str.contains("영남").sum(),\
len(road_3), road_3['사이트제목'].str.contains("지리산").sum(),\
len(road_4), road_4['사이트제목'].str.contains("북한산").sum(),\
len(road_5), road_5['사이트제목'].str.contains("횡성").sum()

(1541, 1541, 1163, 1163, 948, 948, 706, 685, 423, 423)

In [ ]:
len(road2_1), road2_1['사이트제목'].str.contains("서울").sum(),\
len(road2_2), road2_2['사이트제목'].str.contains("영남").sum(),\
len(road2_3), road2_3['사이트제목'].str.contains("지리산").sum(),\
len(road2_4), road2_4['사이트제목'].str.contains("북한산").sum(),\
len(road2_5), road2_5['사이트제목'].str.contains("횡성").sum()

(486, 486, 359, 359, 294, 294, 207, 201, 129, 0)

In [ ]:
len(road3_1), road3_1['사이트제목'].str.contains("서울").sum(),\
len(road3_2), road3_2['사이트제목'].str.contains("영남").sum(),\
len(road3_3), road3_3['사이트제목'].str.contains("지리산").sum(),\
len(road3_4), road3_4['사이트제목'].str.contains("북한산").sum(),\
len(road3_5), road3_5['사이트제목'].str.contains("횡성").sum()

(1055, 1055, 804, 804, 654, 654, 499, 484, 292, 292)

In [ ]:
road_1['사이트제목'][40:80]

1032    서울둘레길! 서울두드림길! 둘레길코스 정보 거리와 시간 특징 스탬프 장소 교통정보 ...
1071    서울둘레길 3코스(3-3구간) : 수서역~방이동생태경관보전지역을 걷다. : 네이버 블로그
1085                                    서울 둘레길 : 네이버 통합검색
1106                                 서울 둘레길 3코스 - Daum 검색
1107                                    서울 둘레길 : 네이버 통합검색
1108                 서울둘레길 3코스-고덕·일자산코스 ② 고덕역 ~ 일자산 ~ 수서역
1129                                  둘레길 코스 상세정보:: 서울둘레길
1158    서울둘레길! 서울두드림길! 둘레길코스 정보 거리와 시간 특징 스탬프 장소 교통정보 ...
1183                                  둘레길 코스 상세정보:: 서울둘레길
1242                                  둘레길 코스 상세정보:: 서울둘레길
1280                                 서울둘레길 4코스 : 네이버 통합검색
1345                     서울 둘레길 4-1코스 : 대모산 둘레길 : 네이버 블로그
1389                               서울둘레길 대모산 산책 : 네이버 블로그
1399                                 서울둘레길 3코스 : 네이버 통합검색
1433                                    서울 둘레길 : 네이버 통합검색
1435    서울둘레길 2코스 : 용마.아차산코스 2-1(화랑대역~중랑캠핑숲~망우산) 忘憂 근심...
1453                                  둘레길 코스 상세정보:: 서울둘레길
1479                                 서울둘레길 4코스 : 네이버 통합검색
1536                                 서울 둘레길 1코스 - Daum 검색
1575                                       서울둘레길4코스 : 네이버
1613         서울둘레길 3코스걷기(고덕.일자산구간) 수서역에서 잠실한강공원 : 네이버 블로그
1649                                 서울둘레길 4코스 : 네이버 VIEW
1656                              서울둘레길 4코스 완주기 : 네이버 블로그
1665                              서울둘레길 4코스 완주기 : 네이버 블로그
1672                                 서울 둘레길 1코스 - Daum 검색
1723                     서울 둘레길 4-1코스 : 대모산 둘레길 : 네이버 블로그
1735         서울둘레길 3코스걷기(고덕.일자산구간) 수서역에서 잠실한강공원 : 네이버 블로그
1808                                  둘레길 코스 상세정보:: 서울둘레길
1864                                      둘레길 코스 :: 서울둘레길
1939                                  둘레길 코스 상세정보:: 서울둘레길
1940    [서울 둘레길] 남산 순환산책길 - 추천코스 : Visit Seoul - 서울시 공...
1943                                 서울둘레길 3코스 : 네이버 통합검색
1949                               서울둘레길 대모산 산책 : 네이버 블로그
1973         서울둘레길 3코스걷기(고덕.일자산구간) 수서역에서 잠실한강공원 : 네이버 블로그
2068                                 서울 둘레길 3코스 - Daum 검색
2095             걷기좋은길서울둘레길 안산자락길 둘레길 트래킹 코스 안내 : 네이버 블로그
2117                                 서울둘레길 4코스 : 네이버 통합검색
2140                                     서울 둘레길 - Daum 검색
2160                                    서울 둘레길 : 네이버 통합검색
2188                     서울 둘레길 4-1코스 : 대모산 둘레길 : 네이버 블로그
Name: 사이트제목, dtype: object

---
---
# df2 : 둘레길 주변관광 이용자 정보

In [ ]:
df2.head()

,주변관광,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,왜목마을,당진당일치기 3 왜목마을 해수욕장 산책 잠깐 들리기 좋은 코스,F,2,NaN,NaN,,,NaN,서울,강동구,명일2동,NaN
1,모악산,100대명산 모악산 84130,M,4,NaN,NaN,,,NaN,전남,화순군,화순읍,NaN
2,보덕사,보덕사 예산,M,4,NaN,NaN,,,NaN,경기,파주시,야동동,NaN
3,한탄강,포천 나들이 비둘기낭폭포 / 한탄강하늘다리 / 계류리예술창고 : 네이버 블로그,F,2,NaN,NaN,,,NaN,전북,익산시,어양동,NaN
4,증평에듀팜특구,SNS기자단 기고 해외 관광객도 즐길 충북의 명소 증평 에듀팜 관광특구,M,3,NaN,NaN,,,NaN,서울,노원구,중계2.3동,NaN

In [ ]:
# Total : 9,468
df2_23 = df2[df2['연령'].isin([2, 3])]     # 4,086, 43.2%
df2_2 = df2[(df2['연령'] == 2)]            # 1,204, 12.7%
df2_3 = df2[(df2['연령'] == 3)]            # 2,882, 30.4%
df2_45 = df2[df2['연령'].isin([4, 5])]     # 5,382, 56.8%

In [ ]:
trip_1 = df2_23.query("주변관광 == '울릉도'")
trip_2 = df2_23.query("주변관광 == '해운대'")
trip_3 = df2_23.query("주변관광 == '남원'")
trip_4 = df2_23.query("주변관광 == '안면도'")
trip_5 = df2_23.query("주변관광 == '죽도'")

In [ ]:
trip2_1 = df2_2.query("주변관광 == '울릉도'")
trip2_2 = df2_2.query("주변관광 == '해운대'")
trip2_3 = df2_2.query("주변관광 == '죽도'")
trip2_4 = df2_2.query("주변관광 == '남원'")
trip2_5 = df2_2.query("주변관광 == '한탄강'")

In [ ]:
trip3_1 = df2_3.query("주변관광 == '해운대'")
trip3_2 = df2_3.query("주변관광 == '울릉도'")
trip3_3 = df2_3.query("주변관광 == '남원'")
trip3_4 = df2_3.query("주변관광 == '안면도'")
trip3_5 = df2_3.query("주변관광 == '태종대'")

In [ ]:
trip_1

,주변관광,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
946,울릉도,울릉도 배편 : 네이버 통합검색,M,3,NaN,NaN,,,NaN,서울,성북구,하월곡동,NaN
1040,울릉도,울릉도 명이나물 장아찌 홀릭 *^^* : 네이버 카페,M,2,NaN,NaN,,,NaN,경기,평택시,안중읍,NaN
1271,울릉도,[울릉도] 울릉도 3일 패키지 (묵호/포항/강릉출발 택1) :: 600개 도시 현지...,M,2,NaN,NaN,,,NaN,경기,부천시 오정구,여월동,NaN
1505,울릉도,[울릉도] 울릉도 3일 패키지 (묵호/포항/강릉출발 택1) :: 600개 도시 현지...,M,2,NaN,NaN,,,NaN,충북,충주시,안림동,NaN
1618,울릉도,울릉도여행 : 네이버 통합검색,M,3,NaN,NaN,,,NaN,서울,강서구,등촌2동,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
8472,울릉도,위드U호텔 - 울릉도 위드U 호텔,M,2,NaN,NaN,,,NaN,광주,광산구,산정동,NaN
8474,울릉도,울릉도숙박업소 깨끗하고 편안한 울릉도올레펜션 : 네이버 블로그,M,2,NaN,NaN,,,NaN,서울,용산구,보광동,NaN
8843,울릉도,울릉도 날씨 : 네이버 통합검색,F,3,"사무직 (일반사무직, 공무원, 직업군인)",400~499만원,예,자녀 없음,아파트/ 주상복합,경기,시흥시,정왕3동,"준중형차 (아반떼, K3, 크루즈, 제타급 등)"
8844,울릉도,울릉도 : 네이버 통합검색,F,3,"사무직 (일반사무직, 공무원, 직업군인)",400~499만원,예,자녀 없음,아파트/ 주상복합,경기,시흥시,정왕3동,"준중형차 (아반떼, K3, 크루즈, 제타급 등)"
8884,울릉도,울릉도 : 네이버 통합검색,F,3,"주부 (전업주부, 파트타임 근무 주부)",300~399만원,예,자녀 있음,아파트/ 주상복합,경기,오산시,갈곶동,"경차 (모닝, 스파크 등)"

### 울릉도

In [ ]:
# 230대 20대
trip_1.query("성별 == 'F'")['시도'].value_counts()[:3],\
trip2_1.query("성별 == 'F'")['시도'].value_counts()[:3]

(부산    128
 서울     21
 대구     19
 Name: 시도, dtype: int64,
 부산    126
 서울      5
 경기      4
 Name: 시도, dtype: int64)

In [ ]:
len(trip_1.query("성별 == 'F'")),\
len(trip_1.query("성별 == 'F' and 시도 == '부산'")),\
len(trip_1.query("성별 == 'F' and 시도 == '부산' and 자동차.notnull()")),\
len(trip2_1.query("성별 == 'F'")),\
len(trip2_1.query("성별 == 'F' and 시도 == '부산'")),\
len(trip2_1.query("성별 == 'F' and 시도 == '부산' and 자동차.notnull()"))

(204, 128, 1, 145, 126, 0)

In [ ]:
trip_1.query("성별 == 'M'")['시도'].value_counts()[:3],\
trip2_1.query("성별 == 'M'")['시도'].value_counts()[:3]

(서울    26
 경기     9
 대구     6
 Name: 시도, dtype: int64,
 서울    11
 경기     5
 충북     1
 Name: 시도, dtype: int64)

In [ ]:
len(trip_1.query("성별 == 'M'")),\
len(trip_1.query("성별 == 'M' and 시도 == '서울'")),\
len(trip_1.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(trip2_1.query("성별 == 'M'")),\
len(trip2_1.query("성별 == 'M' and 시도 == '서울'")),\
len(trip2_1.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(64, 26, 3, 21, 11, 1)

In [ ]:
# 30대
trip3_2.query("성별 == 'F'")['시도'].value_counts()[:3]

대구    18
서울    16
경기    14
Name: 시도, dtype: int64

In [ ]:
len(trip3_2.query("성별 == 'F'")),\
len(trip3_2.query("성별 == 'F' and 시도 == '대구'")),\
len(trip3_2.query("성별 == 'F' and 시도 == '대구' and 자동차.notnull()"))

(59, 18, 6)

In [ ]:
trip3_2.query("성별 == 'M'")['시도'].value_counts()[:3]

서울    15
대구     5
경남     4
Name: 시도, dtype: int64

In [ ]:
len(trip3_2.query("성별 == 'M'")),\
len(trip3_2.query("성별 == 'M' and 시도 == '서울'")),\
len(trip3_2.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(43, 15, 2)

### 해운대

In [ ]:
# 30대
trip3_1.query("성별 == 'F'")['시도'].value_counts()[:3]

인천    38
서울    27
부산    21
Name: 시도, dtype: int64

In [ ]:
len(trip3_1.query("성별 == 'F'")),\
len(trip3_1.query("성별 == 'F' and 시도 == '인천'")),\
len(trip3_1.query("성별 == 'F' and 시도 == '인천' and 자동차.notnull()"))

(128, 38, 2)

In [ ]:
trip3_1.query("성별 == 'M'")['시도'].value_counts()[:3]

경기    14
서울    14
인천     2
Name: 시도, dtype: int64

In [ ]:
len(trip3_1.query("성별 == 'M'")),\
len(trip3_1.query("성별 == 'M' and 시도 == '경기'")),\
len(trip3_1.query("성별 == 'M' and 시도 == '경기' and 자동차.notnull()"))

(37, 14, 10)

In [ ]:
# 230대 20대
trip_2.query("성별 == 'F'")['시도'].value_counts()[:3],\
trip2_2.query("성별 == 'F'")['시도'].value_counts()[:3]

(인천    39
 서울    35
 부산    26
 Name: 시도, dtype: int64,
 서울    8
 부산    5
 경기    3
 Name: 시도, dtype: int64)

In [ ]:
len(trip_2.query("성별 == 'F'")),\
len(trip_2.query("성별 == 'F' and 시도 == '인천'")),\
len(trip_2.query("성별 == 'F' and 시도 == '인천' and 자동차.notnull()")),\
len(trip2_2.query("성별 == 'F'")),\
len(trip2_2.query("성별 == 'F' and 시도 == '서울'")),\
len(trip2_2.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()"))

(150, 39, 2, 22, 8, 0)

In [ ]:
trip_2.query("성별 == 'F'")['시도'].value_counts().keys()[0]

'인천'

In [ ]:
trip2_2.query("성별 == 'F'")['시도'].value_counts().keys()[0]

'서울'

In [ ]:
trip_2.query("성별 == 'M'")['시도'].value_counts()[:3],\
trip2_2.query("성별 == 'M'")['시도'].value_counts()[:3]

(서울    21
 경기    17
 대전     5
 Name: 시도, dtype: int64,
 서울    7
 경북    4
 대전    3
 Name: 시도, dtype: int64)

In [ ]:
len(trip_2.query("성별 == 'M'")),\
len(trip_2.query("성별 == 'M' and 시도 == '서울'")),\
len(trip_2.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(trip2_2.query("성별 == 'M'")),\
len(trip2_2.query("성별 == 'M' and 시도 == '서울'")),\
len(trip2_2.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(63, 21, 4, 26, 7, 1)

### 남원

In [ ]:
# 230대 30대
trip_3.query("성별 == 'F'")['시도'].value_counts()[:3],\
trip3_3.query("성별 == 'F'")['시도'].value_counts()[:3]

(경기    25
 대구    19
 서울     9
 Name: 시도, dtype: int64,
 대구    19
 경기    18
 서울     7
 Name: 시도, dtype: int64)

In [ ]:
len(trip_3.query("성별 == 'F'")),\
len(trip_3.query("성별 == 'F' and 시도 == '경기'")),\
len(trip_3.query("성별 == 'F' and 시도 == '경기' and 자동차.notnull()")),\
len(trip3_3.query("성별 == 'F'")),\
len(trip3_3.query("성별 == 'F' and 시도 == '대구'")),\
len(trip3_3.query("성별 == 'F' and 시도 == '대구' and 자동차.notnull()"))

(74, 25, 13, 60, 19, 0)

In [ ]:
trip_3.query("성별 == 'M'")['시도'].value_counts()[:3],\
trip3_3.query("성별 == 'M'")['시도'].value_counts()[:3]

(경기    18
 서울     8
 충남     3
 Name: 시도, dtype: int64,
 경기    16
 서울     7
 충남     3
 Name: 시도, dtype: int64)

In [ ]:
len(trip_3.query("성별 == 'M'")),\
len(trip_3.query("성별 == 'M' and 시도 == '경기'")),\
len(trip_3.query("성별 == 'M' and 시도 == '경기' and 자동차.notnull()")),\
len(trip3_3.query("성별 == 'M'")),\
len(trip3_3.query("성별 == 'M' and 시도 == '경기'")),\
len(trip3_3.query("성별 == 'M' and 시도 == '경기' and 자동차.notnull()"))

(38, 18, 11, 33, 16, 11)

In [ ]:
# 20대
trip2_4.query("성별 == 'F'")['시도'].value_counts()[:3]

경기    7
충북    2
서울    2
Name: 시도, dtype: int64

In [ ]:
trip2_4.query("성별 == 'M'")['시도'].value_counts()[:3]

경기    2
서울    1
전북    1
Name: 시도, dtype: int64

### 죽도

In [ ]:
trip2_3.query("성별 == 'F'")['시도'].value_counts()[:3]

부산    30
경남     1
경기     1
Name: 시도, dtype: int64

In [ ]:
len(trip2_3.query("성별 == 'F'")),\
len(trip2_3.query("성별 == 'F' and 시도 == '부산'")),\
len(trip2_3.query("성별 == 'F' and 시도 == '부산' and 자동차.notnull()"))

(35, 30, 30)

In [ ]:
trip2_3.query("성별 == 'M'")['시도'].value_counts()[:3]

서울    2
울산    1
경기    1
Name: 시도, dtype: int64

In [ ]:
len(trip2_3.query("성별 == 'M'")),\
len(trip2_3.query("성별 == 'M' and 시도 == '서울'")),\
len(trip2_3.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(4, 2, 0)

In [ ]:
trip_5.query("성별 == 'F'")['시도'].value_counts()[:3]

부산    33
서울     8
경기     6
Name: 시도, dtype: int64

In [ ]:
len(trip_5.query("성별 == 'F'")),\
len(trip_5.query("성별 == 'F' and 시도 == '부산'")),\
len(trip_5.query("성별 == 'F' and 시도 == '부산' and 자동차.notnull()"))

(61, 33, 33)

In [ ]:
trip_5.query("성별 == 'M'")['시도'].value_counts()[:3]

서울    8
경기    3
부산    2
Name: 시도, dtype: int64

In [ ]:
len(trip_5.query("성별 == 'M'")),\
len(trip_5.query("성별 == 'M' and 시도 == '서울'")),\
len(trip_5.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(16, 8, 2)

### 안면도

In [ ]:
trip_4.query("성별 == 'F'")['시도'].value_counts()[:3],\
trip3_4.query("성별 == 'F'")['시도'].value_counts()[:3]

(서울    32
 전북    10
 경기     7
 Name: 시도, dtype: int64,
 서울    27
 전북    10
 경기     6
 Name: 시도, dtype: int64)

In [ ]:
len(trip_4.query("성별 == 'F'")),\
len(trip_4.query("성별 == 'F' and 시도 == '서울'")),\
len(trip_4.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()")),\
len(trip3_4.query("성별 == 'F'")),\
len(trip3_4.query("성별 == 'F' and 시도 == '서울'")),\
len(trip3_4.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()"))

(58, 32, 3, 50, 27, 3)

In [ ]:
trip_4.query("성별 == 'M'")['시도'].value_counts()[:3],\
trip3_4.query("성별 == 'M'")['시도'].value_counts()[:3]

(서울    11
 경기     6
 대전     3
 Name: 시도, dtype: int64,
 서울    10
 경기     5
 대전     3
 Name: 시도, dtype: int64)

In [ ]:
len(trip_4.query("성별 == 'M'")),\
len(trip_4.query("성별 == 'M' and 시도 == '서울'")),\
len(trip_4.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(trip3_4.query("성별 == 'M'")),\
len(trip3_4.query("성별 == 'M' and 시도 == '서울'")),\
len(trip3_4.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(26, 11, 8, 20, 10, 8)

---
---
# df3 : 둘레길 선호 관광 장소

In [ ]:
df3.head()

,선호관광,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,구곡폭포,구곡 폭포 나들이,F,4,NaN,NaN,,,NaN,서울,도봉구,쌍문동,NaN
1,불갑사,불갑사 상사화 개화초기 풍경불갑사상사화축제 날에는 만개할듯,M,5,NaN,NaN,,,NaN,경북,영천시,야사동,NaN
2,신화랑,청도 가볼만한곳 신화랑풍류마을 생각보다 알차,M,3,NaN,NaN,,,NaN,부산,부산진구,전포1동,NaN
3,태조산,천안 태조산421m 흑성산519m,F,5,NaN,NaN,,,NaN,경기,성남시 분당구,수내3동,NaN
4,복전암,토요산행 보문산,F,3,"주부 (전업주부, 파트타임 근무 주부)",900~999만원,예,자녀 있음,아파트/ 주상복합,충남,홍성군,홍성읍,"준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)"

In [ ]:
# Total : 9,468 # df2랑 같네요
df3_23 = df3[df3['연령'].isin([2, 3])]     # 4,086, 43.2%
df3_2 = df3[(df3['연령'] == 2)]            # 1,204, 12.7%
df3_3 = df3[(df3['연령'] == 3)]            # 2,882, 30.4%
df3_45 = df3[df3['연령'].isin([4, 5])]     # 5,382, 56.8%

In [ ]:
df3_23['자동차'].value_counts().sum(), round(df3_23['자동차'].value_counts().sum() / len(df3_23) * 100, 1)

(1275, 31.2)

In [ ]:
df3_23['직업'].value_counts() # 무직, 학생, 주부

사무직 (일반사무직, 공무원, 직업군인)             873
주부 (전업주부, 파트타임 근무 주부)              428
무직                                 292
전문직 (의사, 판검사, 예술가, 종교인)            240
학생 (초중고학생, 대학생, 대학원생)              223
교직 (교사, 유치원교사, 학원강사)               188
자영업 (도소매업, 숙박업, 미용업)               128
서비스직 (요식업, 숙박업, 미용실종업원)            108
생산/노무직 (생산감독, 경비원, 공장근로자)           74
판매직 (상점점원, 보험설계사, 노점상)              74
기타                                  61
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        42
관리직 (사장, 간부, 고위공무원)                 19
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)      6
Name: 직업, dtype: int64

In [ ]:
df3_23['성별'].value_counts() # 16.5% 차이

F    2381
M    1705
Name: 성별, dtype: int64

In [ ]:
df3_23['선호관광'].value_counts()[:5]

울릉도    268
해운대    213
남원     112
안면도     84
죽도      77
Name: 선호관광, dtype: int64

---
---
# df4 : 둘레길 관심인구 관심사/관심분야 (포털 검색 분야) 정보

In [ ]:
df4.head()

,주요관심,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,사회,`내기 골프 논란`... :: 네이버 뉴스,M,4,NaN,NaN,,,NaN,서울,영등포구,문래동3가,NaN
1,사회,해외야구 : 네이버 스포츠,F,5,NaN,NaN,,,NaN,경기,의정부시,신곡1동,NaN
2,TV연예,[단독] “VIP가 ... :: 네이버 뉴스,M,5,"기능직 (자동차정비, 운전기사, 안경사, 택시기사)",300~399만원,아니오,,연립주택/ 다세대/ 빌라,서울,종로구,창신2동,NaN
3,경제,네이버 뉴스,M,3,"사무직 (일반사무직, 공무원, 직업군인)",300~399만원,아니오,,아파트/ 주상복합,서울,구로구,고척2동,NaN
4,사회,[단독] 음주운전... :: 네이버 뉴스,M,3,NaN,NaN,,,NaN,경남,김해시,진영읍,NaN

In [ ]:
df4['연령'].value_counts().sum() - 14883 - 50129

91504

In [ ]:
# Total : 156,516
df4_23 = df4[df4['연령'].isin([2, 3])]     # 65,012, 41.5%
df4_2 = df4[(df4['연령'] == 2)]            # 14,883, 9.5%
df4_3 = df4[(df4['연령'] == 3)]            # 50,129, 32.0%
df4_456 = df4[df4['연령'].isin([4, 5, 6])] # 91,504, 58.5%

In [ ]:
inter_1 = df4_23.query("주요관심 == 'TV연예'")
inter_2 = df4_23.query("주요관심 == '사회'")
inter_3 = df4_23.query("주요관심 == '스포츠'")
inter_4 = df4_23.query("주요관심 == '경제'")
inter_5 = df4_23.query("주요관심 == '정치'")

In [ ]:
inter2_1 = df4_2.query("주요관심 == '사회'")
inter2_2 = df4_2.query("주요관심 == '정치'")
inter2_3 = df4_2.query("주요관심 == 'TV연예'")
inter2_4 = df4_2.query("주요관심 == '스포츠'")
inter2_5 = df4_2.query("주요관심 == '정치'")

In [ ]:
inter3_1 = df4_3.query("주요관심 == 'TV연예'")
inter3_2 = df4_3.query("주요관심 == '사회'")
inter3_3 = df4_3.query("주요관심 == '스포츠'")
inter3_4 = df4_3.query("주요관심 == '경제'")
inter3_5 = df4_3.query("주요관심 == '정치'")

### TV연애

In [ ]:
inter_1.query("성별 == 'F'")['시도'].value_counts()[:3],\
inter3_1.query("성별 == 'F'")['시도'].value_counts()[:3]

(서울    6789
 경기    2911
 경남    2526
 Name: 시도, dtype: int64,
 서울    6500
 경남    2470
 경기    2390
 Name: 시도, dtype: int64)

In [ ]:
len(inter_1.query("성별 == 'F'")),\
len(inter_1.query("성별 == 'F' and 시도 == '서울'")),\
len(inter_1.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()")),\
len(inter3_1.query("성별 == 'F'")),\
len(inter3_1.query("성별 == 'F' and 시도 == '서울'")),\
len(inter3_1.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()"))

(16779, 6789, 801, 15254, 6500, 799)

In [ ]:
inter_1.query("성별 == 'M'")['시도'].value_counts()[:3],\
inter3_1.query("성별 == 'M'")['시도'].value_counts()[:3]

(서울    979
 경기    772
 인천    542
 Name: 시도, dtype: int64,
 서울    741
 경기    541
 인천    469
 Name: 시도, dtype: int64)

In [ ]:
len(inter_1.query("성별 == 'M'")),\
len(inter_1.query("성별 == 'M' and 시도 == '서울'")),\
len(inter_1.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(inter3_1.query("성별 == 'M'")),\
len(inter3_1.query("성별 == 'M' and 시도 == '서울'")),\
len(inter3_1.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(3494, 979, 298, 2477, 741, 260)

In [ ]:
# 20대 3위
inter2_3.query("성별 == 'F'")['시도'].value_counts()[:3]

경기    521
서울    289
경북    210
Name: 시도, dtype: int64

In [ ]:
len(inter2_3.query("성별 == 'F'")),\
len(inter2_3.query("성별 == 'F' and 시도 == '경기'")),\
len(inter2_3.query("성별 == 'F' and 시도 == '경기' and 자동차.notnull()"))

(1525, 521, 22)

In [ ]:
inter2_3.query("성별 == 'M'")['시도'].value_counts()[:3]

서울    238
경기    231
인천     73
Name: 시도, dtype: int64

In [ ]:
len(inter2_3.query("성별 == 'M'")),\
len(inter2_3.query("성별 == 'M' and 시도 == '서울'")),\
len(inter2_3.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(1017, 238, 38)

### 사회

In [ ]:
inter2_1.query("성별 == 'F'")['시도'].value_counts()[:3]

서울    1017
경기     815
충북     310
Name: 시도, dtype: int64

In [ ]:
len(inter2_1.query("성별 == 'F'")),\
len(inter2_1.query("성별 == 'F' and 시도 == '서울'")),\
len(inter2_1.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()"))

(3019, 1017, 68)

In [ ]:
inter2_1.query("성별 == 'M'")['시도'].value_counts()[:3]

경기    1326
서울     740
부산     149
Name: 시도, dtype: int64

In [ ]:
len(inter2_1.query("성별 == 'M'")),\
len(inter2_1.query("성별 == 'M' and 시도 == '경기'")),\
len(inter2_1.query("성별 == 'M' and 시도 == '경기' and 자동차.notnull()"))

(3197, 1326, 63)

In [ ]:
inter_2.query("성별 == 'F'")['시도'].value_counts()[:3],\
inter3_2.query("성별 == 'F'")['시도'].value_counts()[:3]

(경기    4838
 서울    4050
 인천     969
 Name: 시도, dtype: int64,
 경기    4023
 서울    3033
 인천     807
 Name: 시도, dtype: int64)

In [ ]:
len(inter_2.query("성별 == 'F'")),\
len(inter_2.query("성별 == 'F' and 시도 == '경기'")),\
len(inter_2.query("성별 == 'F' and 시도 == '경기' and 자동차.notnull()")),\
len(inter3_2.query("성별 == 'F'")),\
len(inter3_2.query("성별 == 'F' and 시도 == '경기'")),\
len(inter3_2.query("성별 == 'F' and 시도 == '경기' and 자동차.notnull()"))

(13910, 4838, 2775, 10891, 4023, 2637)

In [ ]:
inter_2.query("성별 == 'M'")['시도'].value_counts()[:3],\
inter3_2.query("성별 == 'M'")['시도'].value_counts()[:3]

(경기    2924
 서울    2775
 인천     692
 Name: 시도, dtype: int64,
 서울    2035
 경기    1598
 인천     564
 Name: 시도, dtype: int64)

In [ ]:
len(inter_2.query("성별 == 'M'")),\
len(inter_2.query("성별 == 'M' and 시도 == '경기'")),\
len(inter_2.query("성별 == 'M' and 시도 == '경기' and 자동차.notnull()")),\
len(inter3_2.query("성별 == 'M'")),\
len(inter3_2.query("성별 == 'M' and 시도 == '서울'")),\
len(inter3_2.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(9406, 2924, 731, 6209, 2035, 645)

### 정치

In [ ]:
inter2_2.query("성별 == 'F'")['시도'].value_counts()[:3]

서울    81
경기    65
인천    34
Name: 시도, dtype: int64

In [ ]:
len(inter2_2.query("성별 == 'F'")),\
len(inter2_2.query("성별 == 'F' and 시도 == '서울'")),\
len(inter2_2.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()"))

(259, 81, 7)

In [ ]:
inter2_2.query("성별 == 'M'")['시도'].value_counts()[:3]

경기    868
서울     64
경남     22
Name: 시도, dtype: int64

In [ ]:
len(inter2_2.query("성별 == 'M'")),\
len(inter2_2.query("성별 == 'M' and 시도 == '경기'")),\
len(inter2_2.query("성별 == 'M' and 시도 == '경기' and 자동차.notnull()"))

(1059, 868, 814)

### 스포츠

In [ ]:
inter_3.query("성별 == 'F'")['시도'].value_counts()[:3],\
inter3_3.query("성별 == 'F'")['시도'].value_counts()[:3]

(서울    1283
 경기     897
 인천     230
 Name: 시도, dtype: int64,
 서울    899
 경기    678
 부산    176
 Name: 시도, dtype: int64)

In [ ]:
len(inter_3.query("성별 == 'F'")),\
len(inter_3.query("성별 == 'F' and 시도 == '경기'")),\
len(inter_3.query("성별 == 'F' and 시도 == '경기' and 자동차.notnull()")),\
len(inter3_3.query("성별 == 'F'")),\
len(inter3_3.query("성별 == 'F' and 시도 == '경기'")),\
len(inter3_3.query("성별 == 'F' and 시도 == '경기' and 자동차.notnull()"))

(3532, 897, 276, 2526, 678, 248)

In [ ]:
inter_3.query("성별 == 'M'")['시도'].value_counts()[:3],\
inter3_3.query("성별 == 'M'")['시도'].value_counts()[:3]

(서울    3462
 경기    1686
 인천    1484
 Name: 시도, dtype: int64,
 서울    2211
 경기    1445
 인천    1396
 Name: 시도, dtype: int64)

In [ ]:
len(inter_3.query("성별 == 'M'")),\
len(inter_3.query("성별 == 'M' and 시도 == '경기'")),\
len(inter_3.query("성별 == 'M' and 시도 == '경기' and 자동차.notnull()")),\
len(inter3_3.query("성별 == 'M'")),\
len(inter3_3.query("성별 == 'M' and 시도 == '서울'")),\
len(inter3_3.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(8311, 1686, 1169, 6284, 2211, 1629)

# df5 : 둘레길 관심인구 라이프스타일 (온라인쇼핑몰 이용 카테고리 정보)

In [ ]:
df5.head()

,카테고리,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,레저/자동차,F,4,"서비스직 (요식업, 숙박업, 미용실종업원)",700~799만원,아니오,,단독주택,서울,도봉구,쌍문1동,NaN
1,레저/자동차,F,4,"서비스직 (요식업, 숙박업, 미용실종업원)",700~799만원,아니오,,단독주택,서울,도봉구,쌍문1동,NaN
2,레저/자동차,F,4,"서비스직 (요식업, 숙박업, 미용실종업원)",700~799만원,아니오,,단독주택,서울,도봉구,쌍문1동,NaN
3,패션의류,F,2,NaN,NaN,,,NaN,경기,의정부시,의정부1동,NaN
4,패션의류,F,2,NaN,NaN,,,NaN,경기,의정부시,의정부1동,NaN

In [ ]:
# Total : 68,606
df5_23 = df5[df5['연령'].isin([2, 3])]     # 32,292, 47.1%
df5_2 = df5[(df5['연령'] == 2)]            # 8,887, 13.0%
df5_3 = df5[(df5['연령'] == 3)]            # 23,405, 34.1%
df5_45 = df5[df5['연령'].isin([4, 5])]     # 36,314, 52.9%

In [ ]:
cate_1 = df5_23.query("카테고리 == '식품/건강'")
cate_2 = df5_23.query("카테고리 == '패션의류'")
cate_3 = df5_23.query("카테고리 == '생활/주방'")
cate_4 = df5_23.query("카테고리 == '뷰티'")
cate_5 = df5_23.query("카테고리 == '패션잡화'")

In [ ]:
cate2_1 = df5_2.query("카테고리 == '패션의류'")
cate2_2 = df5_2.query("카테고리 == '패션잡화'")
cate2_3 = df5_2.query("카테고리 == '식품/건강'")
cate2_4 = df5_2.query("카테고리 == '뷰티'")
cate2_5 = df5_2.query("카테고리 == '디지털/가전'")

In [ ]:
cate3_1 = df5_3.query("카테고리 == '식품/건강'")
cate3_2 = df5_3.query("카테고리 == '패션의류'")
cate3_3 = df5_3.query("카테고리 == '생활/주방'")
cate3_4 = df5_3.query("카테고리 == '뷰티'")
cate3_5 = df5_3.query("카테고리 == '패션잡화'")

### 식품/건강

In [ ]:
cate_1.query("성별 == 'F'")['시도'].value_counts()[:3],\
cate3_1.query("성별 == 'F'")['시도'].value_counts()[:3]

(서울    2053
 경기    2050
 대구    1091
 Name: 시도, dtype: int64,
 서울    1893
 경기    1872
 대구    1064
 Name: 시도, dtype: int64)

In [ ]:
len(cate_1.query("성별 == 'F'")),\
len(cate_1.query("성별 == 'F' and 시도 == '서울'")),\
len(cate_1.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()")),\
len(cate3_1.query("성별 == 'F'")),\
len(cate3_1.query("성별 == 'F' and 시도 == '서울'")),\
len(cate3_1.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()"))

(6773, 2053, 1356, 6102, 1893, 1339)

In [ ]:
cate_1.query("성별 == 'M'")['시도'].value_counts()[:3],\
cate3_1.query("성별 == 'M'")['시도'].value_counts()[:3]

(서울    867
 경기    571
 충북    196
 Name: 시도, dtype: int64,
 서울    637
 경기    390
 충북    173
 Name: 시도, dtype: int64)

In [ ]:
len(cate_1.query("성별 == 'M'")),\
len(cate_1.query("성별 == 'M' and 시도 == '서울'")),\
len(cate_1.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(cate3_1.query("성별 == 'M'")),\
len(cate3_1.query("성별 == 'M' and 시도 == '서울'")),\
len(cate3_1.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(2638, 867, 214, 1843, 637, 193)

In [ ]:
# 20대
cate2_3.query("성별 == 'F'")['시도'].value_counts()[:3]

경기    178
서울    160
인천     55
Name: 시도, dtype: int64

In [ ]:
len(cate2_3.query("성별 == 'F'")),\
len(cate2_3.query("성별 == 'F' and 시도 == '경기'")),\
len(cate2_3.query("성별 == 'F' and 시도 == '경기' and 자동차.notnull()"))

(671, 178, 19)

In [ ]:
cate2_3.query("성별 == 'M'")['시도'].value_counts()[:3]

서울    230
경기    181
인천     63
Name: 시도, dtype: int64

In [ ]:
len(cate2_3.query("성별 == 'M'")),\
len(cate2_3.query("성별 == 'M' and 시도 == '서울'")),\
len(cate2_3.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(795, 230, 21)

### 패션의류

In [ ]:
# 20대
cate2_1.query("성별 == 'F'")['시도'].value_counts()[:3]

부산    2231
서울     228
경기     158
Name: 시도, dtype: int64

In [ ]:
len(cate2_1.query("성별 == 'F'")),\
len(cate2_1.query("성별 == 'F' and 시도 == '부산'")),\
len(cate2_1.query("성별 == 'F' and 시도 == '부산' and 자동차.notnull()"))

(2868, 2231, 3)

In [ ]:
cate2_1.query("성별 == 'M'")['시도'].value_counts()[:3]

서울    170
경기    131
부산     41
Name: 시도, dtype: int64

In [ ]:
len(cate2_1.query("성별 == 'M'")),\
len(cate2_1.query("성별 == 'M' and 시도 == '서울'")),\
len(cate2_1.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(561, 170, 23)

In [ ]:
#230 30대
cate_2.query("성별 == 'F'")['시도'].value_counts()[:3],\
cate3_2.query("성별 == 'F'")['시도'].value_counts()[:3]

(부산    2475
 서울    1255
 경기    1106
 Name: 시도, dtype: int64,
 서울    1027
 경기     948
 부산     244
 Name: 시도, dtype: int64)

In [ ]:
len(cate_2.query("성별 == 'F'")),\
len(cate_2.query("성별 == 'F' and 시도 == '부산'")),\
len(cate_2.query("성별 == 'F' and 시도 == '부산' and 자동차.notnull()")),\
len(cate3_2.query("성별 == 'F'")),\
len(cate3_2.query("성별 == 'F' and 시도 == '서울'")),\
len(cate3_2.query("성별 == 'F' and 시도 == '서울' and 자동차.notnull()"))

(5759, 2475, 192, 2891, 1027, 376)

In [ ]:
cate_2.query("성별 == 'M'")['시도'].value_counts()[:3],\
cate3_2.query("성별 == 'M'")['시도'].value_counts()[:3]

(서울    655
 경기    482
 부산    119
 Name: 시도, dtype: int64,
 서울    485
 경기    351
 인천     88
 Name: 시도, dtype: int64)

In [ ]:
len(cate_2.query("성별 == 'M'")),\
len(cate_2.query("성별 == 'M' and 시도 == '서울'")),\
len(cate_2.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()")),\
len(cate3_2.query("성별 == 'M'")),\
len(cate3_2.query("성별 == 'M' and 시도 == '서울'")),\
len(cate3_2.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(1947, 655, 188, 1386, 485, 165)

### 패션잡화

In [ ]:
cate2_2.query("성별 == 'F'")['시도'].value_counts()[:3]

부산    297
서울     98
경기     50
Name: 시도, dtype: int64

In [ ]:
len(cate2_2.query("성별 == 'F'")),\
len(cate2_2.query("성별 == 'F' and 시도 == '부산'")),\
len(cate2_2.query("성별 == 'F' and 시도 == '부산' and 자동차.notnull()"))

(509, 297, 2)

In [ ]:
cate2_2.query("성별 == 'M'")['시도'].value_counts()[:3]

서울    110
경기     36
전북     15
Name: 시도, dtype: int64

In [ ]:
len(cate2_2.query("성별 == 'M'")),\
len(cate2_2.query("성별 == 'M' and 시도 == '서울'")),\
len(cate2_2.query("성별 == 'M' and 시도 == '서울' and 자동차.notnull()"))

(252, 110, 6)